# الأحرف
hofor = {

    # أحرف الجر
    "horof_jar": ["من", "إلى", "عن", "على", "في", "رب", "ب", "ك", "ل", "مذ", "منذ", "حتى", "خلا", "عدا",
                  "حاشا"],  # not complete

    # أحرف العطف
    "horof_atf": ["و", "ف", "ثم", "أو", "أم", "بل"],  # not complete
    # أحرف الجواب
    "horof_jawab": ["لا", "نعم", "بلى", "إي", "أجل", "جلل"],  # not complete
    # أحرف النفي
    "horof_nafi": ["لم", "لما", "لن", "ما", "لن", "لا", "لات", "إن"],
    # أحرف الشرط
    "horof_shart": ["إن", "إذما", "لو", "لولا", "لوما", "أما"],
    # أحرف التحضيض
    "horof_tahded": ["ألا", "هلا", "لولا", "لوما"],  # not complete
    # الأحرف المصدرية
    "horof_masdareh": ["أن", "كي", "كي", "لو", "ما"],
    # أحرف الاستقبال
    "horof_estiqbal": ["س", "سوف"],
    # أحرف التنبيه
    "horof_tanbeh": ["ها", "يا"],
    # أحرف التوكيد
    "horof_tawked": ["ل", "قد"],
    # أحرف الاستفهام
    "horof_astfham": ["من", "أي", "ما", "ماذا", "أين", "متى", "كيف", "كم", "أيان"],
    # أخوات إن
    "akhwat_ena": ["إن", "أن", "كأن", "لكن", "ليت", "لعل", "ذين"],

}
# الأسماء
asma = {

    # أسماء الإشارة
    "asma_eshara_With_ha": ["ذا", "ذه", "ذي", "تي", "ته", "ذان", "ذين", "تان", "تين", "ولاء"],
    "asma_eshara_Without_ha": ["ذاك", "تيك", "ذلك", "تلك", "ذانك", "تانك", "أولئك"],

    # الأسماء الموصولة
    "asma_mosol": ["الذي", "التي", "اللذان", "الذين", "اللتان", "اللتين", "الذين", "الألى", "اللاتي",
                   "اللائي"],  # not complete

    # الأسماء الخمسة
    "asma-khamsa": ["أبو", "أبا", "أبي", "أخو", "أخا", "أخي", "حمو", "حما", "حمي", "فو", "فا", "في", "ذو", "ذا", "ذي"],

    # ظرف الزمان
    "dharf_zaman": ["حين", "صباح", "مساء", "ظهر", "ساعة", "دقيقة", "ثانية", "سنة", "أمس", "يوم", "ليلة", "غدوة", "بكرة",
                    "سحرا", "غدا",
                    "صباحا", "مساء", "ابدا", "قط", "حينا"],
    # ظرف المكان
    "dharf_makan": ["خلف", "قدام", "وراء", "فوق", "عند", "مع", "إزاء", "هنا", "يمين", "شمال", "ميل", "فرسخ", "كيلو"]
}
# الأفعال
afal = {
    # أخوات كان
    "akhwat_kana": ["كان", "أصبح", "أضحى", "ظل", "أمسى", "بات", "ما زال", "ما برح", "ما انفك", "ما فتئ", "ما دام",
                    "صار", "ليس"],

}