[
  {
    "number": 1,
    "collections": [
      "البخاري",
      "مسلم"
    ],
    "narrator": "عمر بن الخطاب",
    "authenticity": "متفق عليه",
    "content": "إنما الأعمال بالنيات، وإنما لكل امرئ ما نوى، فمن كانت هجرته إلى الله ورسوله فهجرته إلى الله ورسوله، ومن كانت هجرته لدنيا يصيبها أو امرأة ينكحها فهجرته إلى ما هاجر إليه"
  },
  {
    "number": 2,
    "collections": [
      "مسلم"
    ],
    "narrator": "عمر بن الخطاب",
    "authenticity": "رواه مسلم",
    "content": "بينما نحن جلوس عند رسول الله  ذات يوم، إذ طلع علينا رجل شديد بياض الثياب، شديد سواد الشعر، لا يرى عليه أثر السفر، ولا يعرفه منا أحد. حتى جلس إلى النبي  . فأسند ركبتيه إلى ركبتيه، ووضع كفيه على فخذيه، وقال: يا محمد أخبرني عن الإسلام. فقال رسول الله  الإسلام أن تشهد أن لا إله إلا الله وأن محمدا رسول الله، وتقيم الصلاة، وتؤتي الزكاة، وتصوم رمضان، وتحج البيت إن استطعت إليه سبيلا. قال: صدقت . فعجبنا له يسأله ويصدقه! قال: فأخبرني عن الإيمان. قال: أن تؤمن بالله وملائكته وكتبه ورسله واليوم الآخر، وتؤمن بالقدر خيره وشره. قال: صدقت. قال: فأخبرني عن الإحسان. قال: أن تعبد الله كأنك تراه، فإن لم تكن تراه فإنه يراك. قال: فأخبرني عن الساعة. قال: ما المسئول عنها بأعلم من السائل. قال: فأخبرني عن أماراتها؟ قال: أن تلد الأمة ربتها، وأن ترى الحفاة العراة العالة رعاء الشاء يتطاولون في البنيان. ثم انطلق، فلبثنا مليا، ثم قال: يا عمر أتدري من السائل؟. قلت: الله ورسوله أعلم. قال: فإنه جبريل أتاكم يعلمكم دينكم "
  },
  {
    "number": 3,
    "collections": [
      "البخاري",
      "مسلم"
    ],
    "narrator": "عبد الله بن عمر بن الخطاب",
    "authenticity": "متفق عليه",
    "content": "بني الإسلام على خمس: شهادة أن لا إله إلا الله وأن محمدا رسول الله، وإقام الصلاة، وإيتاء الزكاة، وحج البيت، وصوم رمضان"
  },
  {
    "number": 4,
    "collections": [
      "البخاري",
      "مسلم"
    ],
    "narrator": "ابن مسعود",
    "authenticity": "متفق عليه",
    "content": "إن أحدكم يجمع خلقه في بطن أمه أربعين يوما نطفة، ثم يكون علقة مثل ذلك، ثم يكون مضغة مثل ذلك، ثم يرسل إليه الملك فينفخ فيه الروح، ويؤمر بأربع كلمات: بكتب رزقه، وأجله، وعمله، وشقي أم سعيد؛ فوالله الذي لا إله غيره إن أحدكم ليعمل بعمل أهل الجنة حتى ما يكون بينه وبينها إلا ذراع فيسبق عليه الكتاب فيعمل بعمل أهل النار فيدخلها. وإن أحدكم ليعمل بعمل أهل النار حتى ما يكون بينه وبينها إلا ذراع فيسبق عليه الكتاب فيعمل بعمل أهل الجنة فيدخلها"
  },
  {
    "number": 5,
    "collections": [
      "البخاري",
      "مسلم"
    ],
    "narrator": "عائشة بنت أبي بكر",
    "authenticity": "متفق عليه",
    "content": "من أحدث في أمرنا هذا ما ليس منه فهو رد"
  }
]